{
	"advancements.hexcassettes.quinio.title": "Quinio",
	"advancements.hexcassettes.quinio.description": "Make a hex cast a hex",

	"subtitles.hexcassettes.cassette_eject": "Cassette ejects",

	"item.hexcassettes.cassette": "Cassette",

	"hexcasting.mishap.hexcassettes:too_many_cassettes": "Attempted to schedule more hexes than owned cassettes.",

	"hexcassettes.page.queuing.title": "Queuing",
	"hexcassettes.page.queuing.0": "As part of their nature, _Hexes evaluate in their entirety instantly. To delay _Hexes, Nature has devised a quite the whimsical solution: a cassette tape that must be crafted and then \"consumed\". I can have up to six cassettes, and each _Hex I request to delay takes up one cassette. These cassettes can be viewed in my inventory and I can simply click them to abort the _Hex.",
	"hexcassettes.page.queuing.1": "If a _Hex casts a near-identical copy of itself, a phenomenon emerges that ancient _Hexcasters call a daemon, which allow for passive _Hexcasting. Study into this branch of _Hexcasting seems limited and I shall be careful if I want to delve in: this type of casting uses exclusively the media from my inventory and if left unchecked, rapid automated casting can easily drain all my media and with nothing else to consume, my life.",
    "hexcasting.spell.hexcassettes:enqueue": "Enqueue",
    "hexcassettes.page.enqueue.summary": "Enqueues a hex to cast after that many twentieths of a second. It takes an iota to use as the label for the cassette.",
	"hexcassettes.page.queuing.2": "The label iota is used only to distinguish cassettes from each other for manual cancelation and only the first 32 characters are kept. If I attempt to enqueue more hexes than I have cassettes, I incur the Parallel Processing mishap which kills all my currently active cassettes. I can only have up to six cassettes.$(br2)$(o)Ibra oniki ra. QUINIO QUINIO QUINIO QUINIO alef a ra.$()",
    "hexcassettes.page.queuing.3": "Once a _Hex has been enqueued, I can open my chat screen to see all the cassettes I have eaten. By pressing an enqueued cassette and referencing its label to distinguish them, I can cancel that queued hex.",
    "hexcasting.spell.hexcassettes:dequeue": "Dequeue",
    "hexcassettes.page.dequeue.summary": "I can also automate dequeuing cassettes with this pattern. It takes an iota and kills all cassettes with a label."
}
